<?php

return [

    /*
    |--------------------------------------------------------------------------
    | oauth配置文件设置
    |--------------------------------------------------------------------------
    */

    'passport' => [
        'personal_access_client_id' => env('PASSPORT_PERSONAL_ACCESS_CLIENT_ID1'),
        'personal_access_client_secret' => env('PASSPORT_PERSONAL_ACCESS_CLIENT_SECRET'),
        'grant_client_id' => env('PASSPORT_PASSWORD_GRANT_CLIENT_ID'),
        'grant_client_secret' => env('PASSPORT_PASSWORD_GRANT_CLIENT_SECRET'),
    ],

    /*
    |--------------------------------------------------------------------------
    | 后台账号初始化信息
    |--------------------------------------------------------------------------
    */

    'admin' => [
        'name' => env('ADMIN_NAME'),
        'password' => env('ADMIN_PASSWORD'),
    ],

    /*
    |--------------------------------------------------------------------------
    | 文章列表字数显示设置
    |--------------------------------------------------------------------------
    */

    'article' => [
        'limit' => 256,
        'hot_limit' => 5,
        'new_limit' => 5,
    ],

    /*
    |--------------------------------------------------------------------------
    | github配置文件设置
    |--------------------------------------------------------------------------
    */
    'webHook' => [
        'token' => env('GITHUB_DEPLOY_TOKEN'),
    ],

    /*
    |--------------------------------------------------------------------------
    | cacheArticle缓存文章详情，默认分钟
    |--------------------------------------------------------------------------
    */
    'cacheArticle' => 5,

    /*
    |--------------------------------------------------------------------------
    | codeMessage配置文件设置
    |--------------------------------------------------------------------------
    */
    'codeMessage' => [
        /* 系统相关码值 */
        '10000' => '操作成功',
        '20000' => '操作失败',
        '20001' => '请求参数格式不正确',
        '20002' => '请求参数缺失',
        /* 用户登陆错误相关码值 */
        '30001' => '用户密码错误',
        '30002' => '用户名错误',
        '30003' => '用户登陆失效',
        /* 数据库操作失败相关码值 */
        '40001' => '数据库插入失败',
        '40002' => '数据库删除失败',
        '40003' => '数据库保存失败',
        '40004' => '数据库查询失败',
        /* 文件上传错误相关码值 */
        '50001' => '文件格式不正确',
        '50002' => '文件大小不正确',
        '50003' => '文件上传方式不正确',
    ],
];